In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

C:\Users\admin\Anaconda3\lib\site-packages\statsmodels\tools\_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [2]:
train = pd.read_csv('C:/Users/admin/Downloads/train.csv', index_col='PassengerId')
test = pd.read_csv('C:/Users/admin/Downloads/test.csv',index_col='PassengerId')

In [3]:
print(train.shape)
print(test.shape)

(889, 11)
(417, 9)

In [4]:
train.head(6)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,0,3,"Moran, Mr. James",male,45.0,0,0,330877,8.4583,NaN,Q

In [5]:
test.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
PassengerId,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,S

In [6]:
train.isna().sum()

Survived      0
Pclass        0
Name          0
Sex           0
Age           0
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      0
dtype: int64

In [7]:
test.isna().sum()

Pclass      0
Name        0
Sex         0
Age         0
SibSp       0
Parch       0
Ticket      0
Fare        0
Embarked    0
dtype: int64

In [8]:
train.describe(include='all').T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
Survived,889,NaN,NaN,NaN,0.382452,0.48626,0,0,0,1,1
Pclass,889,NaN,NaN,NaN,2.31159,0.8347,1,2,3,3,3
Name,889,889,"Serepeca, Miss. Augusta",1,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Sex,889,2,male,577,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Age,889,NaN,NaN,NaN,32.6999,14.3468,0.42,22,32,45,80
SibSp,889,NaN,NaN,NaN,0.524184,1.1037,0,0,0,1,8
Parch,889,NaN,NaN,NaN,0.382452,0.806761,0,0,0,0,6
Ticket,889,680,1601,7,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Fare,889,NaN,NaN,NaN,32.0967,49.6975,0,7.8958,14.4542,31,512.329
Cabin,202,146,G6,4,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Embarked,889,3,S,644,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [9]:
train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 889 entries, 1 to 891
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  889 non-null    int64
 1   Pclass    889 non-null    int64
 2   Name      889 non-null    object
 3   Sex       889 non-null    object
 4   Age       889 non-null    float64
 5   SibSp     889 non-null    int64
 6   Parch     889 non-null    int64
 7   Ticket    889 non-null    object
 8   Fare      889 non-null    float64
 9   Cabin     202 non-null    object
 10  Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 83.3+ KB

### Filling the Missing values of Cabin

In [10]:
# Filling the NaN values with the new category "Missing"
train = train.fillna('Missing', axis=1)

In [11]:
train.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,Missing,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,Missing,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,Missing,S

### Handle the Categorical columns

In [12]:
train.nunique()

Survived      2
Pclass        3
Name        889
Sex           2
Age          88
SibSp         7
Parch         7
Ticket      680
Fare        247
Cabin       147
Embarked      3
dtype: int64

In [13]:
# from sklearn.feature_extraction import FeatureHasher
# fh = FeatureHasher(n_features=10, input_type='string')

In [14]:
# feature = fh.fit_transform(train['Cabin'])

# feature = feature.toarray()
# train = pd.concat([train, pd.DataFrame(feature)], axis=1)
# train.head()

In [15]:
train['Cabin'] = train['Cabin'].astype('str').str[0]
train.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,M,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,M,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,M,S

In [16]:
ordinal_cabin = train.groupby(['Cabin'])['Survived'].mean().sort_values().index
ordinal_cabin

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [17]:
ordinal_cabin_dict = {k:i for i,k in enumerate(ordinal_cabin, 0)}
ordinal_cabin_dict

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [18]:
train['Cabin'] = train['Cabin'].map(ordinal_cabin_dict)
train.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,1,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,4,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,1,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,4,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,1,S

In [19]:
train.Embarked.unique()

array(['S', 'C', 'Q'], dtype=object)

In [20]:
# Apply OneHotEncoding on "Sex" and "Embarked" features
train_onehot = pd.get_dummies(train['Embarked'],drop_first=True)
train = pd.concat([train, train_onehot], axis=1)
train['Sex_M'] = np.where(train.Sex == 'male', 1,0)

In [21]:
train_onehot = pd.get_dummies(train, columns=['Sex','Embarked'],drop_first=True)

In [22]:
train.drop(['Sex', 'Embarked'], axis=1, inplace= True)

In [23]:
train.drop([], axis=1 , inplace= True)

In [24]:
train.head()

,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Q,S,Sex_M
PassengerId,,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 21171,7.2500,1,0,1,1
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 17599,71.2833,4,0,0,0
3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 3101282,7.9250,1,0,1,0
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,113803,53.1000,4,0,1,0
5,0,3,"Allen, Mr. William Henry",35.0,0,0,373450,8.0500,1,0,1,1

In [25]:
# Apply OneHotEncoding on "Sex" and "Embarked" features intest datast
test_onehot = pd.get_dummies(test['Embarked'],drop_first=True)
test = pd.concat([test, test_onehot], axis=1)
test['Sex_M'] = np.where(test.Sex == 'male', 1,0)

In [26]:
print('No. of unique categories in Ticket feature:',train['Ticket'].nunique())
print('no. of unique categories in Name feature:',train.Name.nunique())

No. of unique categories in Ticket feature: 680
no. of unique categories in Name feature: 889

In [27]:
train['Ticket'].nunique()

680

In [28]:
train = train.drop(['Name', 'Ticket'], axis=1)

In [29]:
test = test.drop(['Name', 'Sex', 'Embarked','Ticket'], axis=1)

In [30]:
train.head()

             Survived  Pclass   Age  SibSp  Parch     Fare  Cabin  Q  S  Sex_M
PassengerId
1                   0       3  22.0      1      0   7.2500      1  0  1      1
2                   1       1  38.0      1      0  71.2833      4  0  0      0
3                   1       3  26.0      0      0   7.9250      1  0  1      0
4                   1       1  35.0      1      0  53.1000      4  0  1      0
5                   0       3  35.0      0      0   8.0500      1  0  1      1

In [31]:
test.head()

             Pclass   Age  SibSp  Parch     Fare  Q  S  Sex_M
PassengerId
892               3  34.5      0      0   7.8292  1  0      1
893               3  47.0      1      0   7.0000  0  1      0
894               2  62.0      0      0   9.6875  1  0      1
895               3  27.0      0      0   8.6625  0  1      1
896               3  22.0      1      1  12.2875  0  1      0

## Built a Model for Decision tree

In [32]:
from sklearn.model_selection import train_test_split
from sklearn.tree import DecisionTreeClassifier
import statsmodels.api as sm

In [33]:
dt = DecisionTreeClassifier()

In [34]:
X_train = train.drop(['Survived','Cabin'], axis=1) # "Cabin" column is missing in test dataset
y_train = train['Survived']

In [35]:
X_test = test.copy

In [36]:
test.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 417 entries, 892 to 1309
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Pclass  417 non-null    int64
 1   Age     417 non-null    float64
 2   SibSp   417 non-null    int64
 3   Parch   417 non-null    int64
 4   Fare    417 non-null    float64
 5   Q       417 non-null    uint8
 6   S       417 non-null    uint8
 7   Sex_M   417 non-null    int32
dtypes: float64(2), int32(1), int64(3), uint8(2)
memory usage: 22.0 KB

In [37]:
train.Survived.value_counts()

0    549
1    340
Name: Survived, dtype: int64

In [38]:
dt.fit(X_train, y_train)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
                       max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort=False,
                       random_state=None, splitter='best')

In [39]:
predict = dt.predict(test)

In [40]:
dt.score(X_train, y_train)

0.9797525309336333

In [41]:

from sklearn.model_selection import KFold, cross_val_score
from sklearn.metrics import make_scorer, r2_score

cv = KFold(n_splits = 3, shuffle=True, random_state = 45)
r2 = make_scorer(r2_score)
r2_val_score = cross_val_score(dt, X_train, y_train, cv=cv, scoring = r2)
score = [r2_val_score.mean()]

score

[0.03285514550290066]

## Random forest Classifier model

In [42]:
from sklearn.ensemble import RandomForestClassifier
Rf = RandomForestClassifier(n_estimators=1000, max_features=2, oob_score=True)
Rf.fit(X_train, y_train)

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
                       max_depth=None, max_features=2, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=1000,
                       n_jobs=None, oob_score=True, random_state=None,
                       verbose=0, warm_start=False)

In [43]:
predict = Rf.predict(test)

In [44]:
Rf.score(X_train, y_train)

0.9797525309336333

In [45]:
print(Rf.oob_score_)

0.8042744656917885

In [46]:
for i,k in zip(X_train.columns, Rf.feature_importances_):
    print(i,'\t \t: ',k)

Pclass 	 	:  0.08620424262851199
Age 	 	:  0.2581424122441767
SibSp 	 	:  0.051269974685777805
Parch 	 	:  0.04064179733820746
Fare 	 	:  0.27358988232737447
Q 	 	:  0.010410622987502774
S 	 	:  0.0230998695859243
Sex_M 	 	:  0.25664119820252435

### New model for new Features

__So, the "Sex", "Fare" and "Age" are the most significant features for Survived Feature(Tsrget vsrisble).__

__We can increase our accuracy of our model by using these attributes.__

In [47]:
X_train = train.loc[: ,['Age','Fare', 'Sex_M']]
y_train = train['Survived']

X_test = test.loc[: ,['Age','Fare', 'Sex_M']]

In [48]:
X_train.head()

              Age     Fare  Sex_M
PassengerId
1            22.0   7.2500      1
2            38.0  71.2833      0
3            26.0   7.9250      0
4            35.0  53.1000      0
5            35.0   8.0500      1

In [49]:
dt = DecisionTreeClassifier()
dt.fit(X_train, y_train)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
                       max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort=False,
                       random_state=None, splitter='best')

In [50]:
y_predict = dt.predict(X_test)

In [51]:
dt.score(X_train, y_train)

0.9763779527559056

**Now Apply Random forest classifier model and check score**

In [52]:
Rf = RandomForestClassifier(n_estimators=1000, max_features=2, oob_score=True)
Rf.fit(X_train, y_train)

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
                       max_depth=None, max_features=2, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=1000,
                       n_jobs=None, oob_score=True, random_state=None,
                       verbose=0, warm_start=False)

In [53]:
Rf.score(X_train, y_train)

0.9763779527559056

In [54]:
print(Rf.oob_score_)

0.7885264341957255

__So, our accuracy is decreases in these features we can add or del some features and then check score fot them. This is all just a hit and trail method to improve accuracy score of our model.__

### New Model for new Features


__So, the "Sex", "Fare", "Age" and "Pclass" are the most significant features for Survived Feature(Tsrget vsrisble).__

__We can increase our accuracy of our model by using these attributes.__

In [55]:
X_train = train.loc[: ,['Age','Fare', 'Sex_M','Pclass']]
y_train = train['Survived']

X_test = test.loc[: ,['Age','Fare', 'Sex_M', 'Pclass']]

In [56]:
test.head()

             Pclass   Age  SibSp  Parch     Fare  Q  S  Sex_M
PassengerId
892               3  34.5      0      0   7.8292  1  0      1
893               3  47.0      1      0   7.0000  0  1      0
894               2  62.0      0      0   9.6875  1  0      1
895               3  27.0      0      0   8.6625  0  1      1
896               3  22.0      1      1  12.2875  0  1      0

In [57]:
dt = DecisionTreeClassifier()
dt.fit(X_train, y_train)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
                       max_features=None, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, presort=False,
                       random_state=None, splitter='best')

In [58]:
y_predict = dt.predict(X_test)

In [59]:
dt.score(X_train, y_train)

0.9763779527559056

**Now Apply Random forest classifier model and check score**

In [60]:
Rf = RandomForestClassifier(n_estimators=1000, max_features=2, oob_score=True)
Rf.fit(X_train, y_train)

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
                       max_depth=None, max_features=2, max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=1000,
                       n_jobs=None, oob_score=True, random_state=None,
                       verbose=0, warm_start=False)

In [61]:
print(Rf.oob_score_)

0.8177727784026997

__So, our accuracy is better than last model and main model also. So, for these features we can predict our Target feature.__

In [62]:
y_predict = dt.predict(X_test)

In [63]:
predict_values = pd.DataFrame({'PassengerId': test.index , 'Survived': y_predict})
predict_values.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         1
3          895         1
4          896         0

In [64]:
predict_values.to_csv("Output_titanic.csv", index=False) # Getting results into a csv format with survived column